results/PerconaServer/Broadwell/events/noDyni-select_random_points.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            43430
        write:                           0
        other:                           0
        total:                           43430
    transactions:                        43430  (723.80 per sec.)
    queries:                             43430  (723.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0006s
    total number of events:              43430

Latency (ms):
         min:                                  0.33
         avg:                                  1.38
         max:                                  1.95
         95th percentile:                      1.73
         sum:                              59950.77

Threads fairness:
    events (avg/stddev):           43430.0000/0.00
    execution time (avg/stddev):   59.9508/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            533273
        write:                           0
        other:                           0
        total:                           533273
    transactions:                        533273 (8887.45 per sec.)
    queries:                             533273 (8887.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0008s
    total number of events:              533273

Latency (ms):
         min:                                  0.10
         avg:                                  0.22
         max:                                  3.13
         95th percentile:                      1.34
         sum:                             119543.20

Threads fairness:
    events (avg/stddev):           266636.5000/224448.50
    execution time (avg/stddev):   59.7716/0.18

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1253696
        write:                           0
        other:                           0
        total:                           1253696
    transactions:                        1253696 (20893.66 per sec.)
    queries:                             1253696 (20893.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0016s
    total number of events:              1253696

Latency (ms):
         min:                                  0.12
         avg:                                  0.19
         max:                                  5.38
         95th percentile:                      0.16
         sum:                             238660.75

Threads fairness:
    events (avg/stddev):           313424.0000/158464.17
    execution time (avg/stddev):   59.6652/0.17

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1755253
        write:                           0
        other:                           0
        total:                           1755253
    transactions:                        1755253 (29252.76 per sec.)
    queries:                             1755253 (29252.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0009s
    total number of events:              1755253

Latency (ms):
         min:                                  0.13
         avg:                                  0.27
         max:                                  4.37
         95th percentile:                      0.26
         sum:                             477274.97

Threads fairness:
    events (avg/stddev):           219406.6250/74484.99
    execution time (avg/stddev):   59.6594/0.12

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1849047
        write:                           0
        other:                           0
        total:                           1849047
    transactions:                        1849047 (30815.68 per sec.)
    queries:                             1849047 (30815.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0014s
    total number of events:              1849047

Latency (ms):
         min:                                  0.16
         avg:                                  0.52
         max:                                848.56
         95th percentile:                      0.68
         sum:                             957163.48

Threads fairness:
    events (avg/stddev):           115565.4375/27048.21
    execution time (avg/stddev):   59.8227/0.04

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2022999
        write:                           0
        other:                           0
        total:                           2022999
    transactions:                        2022999 (33714.11 per sec.)
    queries:                             2022999 (33714.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0026s
    total number of events:              2022999

Latency (ms):
         min:                                  0.19
         avg:                                  0.95
         max:                                125.19
         95th percentile:                      1.12
         sum:                            1916592.16

Threads fairness:
    events (avg/stddev):           63218.7188/10423.46
    execution time (avg/stddev):   59.8935/0.02

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2004040
        write:                           0
        other:                           0
        total:                           2004040
    transactions:                        2004040 (33395.50 per sec.)
    queries:                             2004040 (33395.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0073s
    total number of events:              2004040

Latency (ms):
         min:                                  0.18
         avg:                                  1.91
         max:                                417.65
         95th percentile:                      2.14
         sum:                            3836119.61

Threads fairness:
    events (avg/stddev):           31313.1250/3646.46
    execution time (avg/stddev):   59.9394/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1998324
        write:                           0
        other:                           0
        total:                           1998324
    transactions:                        1998324 (33297.63 per sec.)
    queries:                             1998324 (33297.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0120s
    total number of events:              1998324

Latency (ms):
         min:                                  0.12
         avg:                                  3.84
         max:                              13603.18
         95th percentile:                      4.33
         sum:                            7676483.95

Threads fairness:
    events (avg/stddev):           15611.9062/1950.91
    execution time (avg/stddev):   59.9725/0.00